benchmark/web/results/result_w8_1.log
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/json
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 32 sec, 822 millisec and 889 microsec, 152332 req/s, 44182 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1485000000 bytes total, 1105000000 bytes http, 380000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/json
Running 1m test @ http://10.0.1.3:8080/json
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms    2.12ms  63.45ms   96.30%
    Req/Sec    22.08k     2.00k   26.86k    68.82%
  Latency Distribution
     50%  664.00us
     75%    0.87ms
     90%    1.08ms
     99%   13.73ms
  10562188 requests in 1.00m, 2.92GB read
Requests/sec: 175743.56
Transfer/sec:     49.78MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=256
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 30 sec, 253 millisec and 978 microsec, 165267 req/s, 61813 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1915000000 bytes total, 635000000 bytes http, 1280000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=256
Running 1m test @ http://10.0.1.3:8080/resource?count=256
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms    2.20ms  88.68ms   96.22%
    Req/Sec    22.47k     2.30k   28.34k    67.91%
  Latency Distribution
     50%  664.00us
     75%    0.85ms
     90%    1.08ms
     99%   14.04ms
  10751631 requests in 1.00m, 3.84GB read
Requests/sec: 178895.54
Transfer/sec:     65.34MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=4096
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 39 sec, 188 millisec and 291 microsec, 127589 req/s, 526305 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 21120000000 bytes total, 640000000 bytes http, 20480000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=4096
Running 1m test @ http://10.0.1.3:8080/resource?count=4096
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.57ms    2.97ms  69.90ms   94.21%
    Req/Sec    17.15k     1.77k   21.49k    70.28%
  Latency Distribution
     50%  828.00us
     75%    1.07ms
     90%    1.51ms
     99%   17.75ms
  8203110 requests in 1.00m, 32.27GB read
Requests/sec: 136491.77
Transfer/sec:    549.83MB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/resource?count=65536
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 281 sec, 233 millisec and 958 microsec, 17778 req/s, 1140082 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 328325000000 bytes total, 645000000 bytes http, 327680000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/resource?count=65536
Running 1m test @ http://10.0.1.3:8080/resource?count=65536
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.83ms    8.55ms 120.47ms   90.11%
    Req/Sec     2.24k   309.09     3.23k    68.01%
  Latency Distribution
     50%    6.57ms
     75%    8.85ms
     90%   17.22ms
     99%   47.47ms
  1070317 requests in 1.00m, 65.46GB read
Requests/sec:  17808.66
Transfer/sec:      1.09GB
weighttp -n 5000000 -c 128 -t 8 -k http://10.0.1.3:8080/
weighttp 0.3 - a lightweight and simple webserver benchmarking tool

starting benchmark...
spawning thread #1: 16 concurrent requests, 625000 total requests
spawning thread #2: 16 concurrent requests, 625000 total requests
spawning thread #3: 16 concurrent requests, 625000 total requests
spawning thread #4: 16 concurrent requests, 625000 total requests
spawning thread #5: 16 concurrent requests, 625000 total requests
spawning thread #6: 16 concurrent requests, 625000 total requests
spawning thread #7: 16 concurrent requests, 625000 total requests
spawning thread #8: 16 concurrent requests, 625000 total requests
progress:  10% done
progress:  20% done
progress:  30% done
progress:  40% done
progress:  50% done
progress:  60% done
progress:  70% done
progress:  80% done
progress:  90% done
progress: 100% done

finished in 84 sec, 242 millisec and 367 microsec, 59352 req/s, 16576 kbyte/s
requests: 5000000 total, 5000000 started, 5000000 done, 5000000 succeeded, 0 failed, 0 errored
status codes: 5000000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 1430000000 bytes total, 1360000000 bytes http, 70000000 bytes data
wrk -c 128 -t 8 --latency -d 60 http://10.0.1.3:8080/
Running 1m test @ http://10.0.1.3:8080/
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47ms    3.23ms 103.70ms   96.38%
    Req/Sec     7.92k     1.02k   10.49k    70.97%
  Latency Distribution
     50%    1.88ms
     75%    2.49ms
     90%    3.18ms
     99%   19.39ms
  3790877 requests in 1.00m, 1.01GB read
Requests/sec:  63076.04
Transfer/sec:     17.20MB